### 데이터 분석을 진행하게 되면 가장 중요한 데이터의 형태를 이해하고 있어야 한다.
- DataFrame을 다룬다.
- pandas 다룰 것, numpy 연산 두 개만으로도 충분히 데이터 분석에 필요한 전처리가 가능하다!

In [1]:
import pandas as pd

In [2]:
a = [[1,2],[3,4],[5,6]]

In [3]:
a

[[1, 2], [3, 4], [5, 6]]

- 2차원 리스트
- 인덱스 접근시 [][]

In [4]:
a[0][1]

2

- 데이터프레임은
- 행과 열로 이루어 짐
- 행(index) 열(column)

In [5]:
df = pd.DataFrame({'이름':['홍길동','김영희','김철수'],
                  '수학':[50,40,30],
                  '영어':[100,80,90]})

In [6]:
df

    이름  수학   영어
0  홍길동  50  100
1  김영희  40   80
2  김철수  30   90

- 데이터프레임 형태
- 이름, 수학, 영어 컬럼 (열)
- 0,1,2 index 개념 행

- 값을 추출할 경우 
- 내가 원하는 값만 추출하는 경우
- 나느 지금 수학 성적만 필요해!

- df를 접근하는 방식은 2가지
- 행과 열을 기준으로 접근할 수 있다.

In [8]:
df

    이름  수학   영어
0  홍길동  50  100
1  김영희  40   80
2  김철수  30   90

In [7]:
#열을 기준으로 가져오기
df['수학'] # 시리즈형태

0    50
1    40
2    30
Name: 수학, dtype: int64

In [9]:
df['수학'].to_frame()

   수학
0  50
1  40
2  30

### 나 수학, 영어 둘 다 필요해!

In [10]:
#2차원
df[['수학','영어']]

   수학   영어
0  50  100
1  40   80
2  30   90

In [11]:
#2차원
df[['이름','수학','영어']]

    이름  수학   영어
0  홍길동  50  100
1  김영희  40   80
2  김철수  30   90

In [12]:
sum(df['수학'])

120

In [13]:
sum(df['수학'])/3

40.0

- 데이터프레임을 만드는 게 아니라 불러와서 데이터 분석을 하는 경우가 많다.
- 내가 만든 데이터, 이미 만들어진 다른 데이터

In [14]:
import seaborn as sns

In [15]:
df_tt = sns.load_dataset('titanic')

In [24]:
df_tt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
df_tt.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [21]:
df_tt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [23]:
df_tt.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- 문자열 데이터를 전처리한다? 머신에 학습시키기위해 인코딩, 엔지니어링 등을 하는 것이 결국 비정형데이터-> 정형데이터( 수치 데이터)로 바꾼다, 정량적 데이터로 바꾼다. 

- why? 
- 컴퓨터는 0과 1밖에 즉 숫자밖에 이해하지 못 한다.